<?php
/**
 * 易優CMS
 * ============================================================================
 * 版權所有 2016-2028 海南贊贊網路科技有限公司，並保留所有權利。
 * 網站地址: http://www.eyoucms.com
 * ----------------------------------------------------------------------------
 * 如果商業用途務必到官方購買正版授權, 以免引起不必要的法律糾紛.
 * ============================================================================
 * Author: 小虎哥 <1105415366@qq.com>
 * Date: 2018-4-3
 */

return array(
    'mysql' => array(
        '1045:0'        => "請仔細覈對數據庫賬號和密碼。",
        '1049:0'        => "數據庫不存在，請仔細檢查覈對。",
        '2002:0'        => "連線數據庫失敗，請點選：<a href='http://www.eyoucms.com/wenda/6236.html' target='_blank'>檢視教程</a>",
        '22001:1406'    => "插入欄位長度超過設定的長度，請聯繫技術處理。",
        '42000:1055'    => "數據庫sql_mode模式對GROUP BY聚合操作\n請點選：<a href='http://www.eyoucms.com/wenda/744.html' target='_blank'>檢視教程</a>",
        '42S02:1146'    => "數據表或檢視不存在，請聯繫技術處理。",
        'HY000:1017'    => "數據表或檢視不存在，請聯繫技術處理。",
        'HY000:1030'    => "磁碟臨時空間不夠導致，請聯繫空間服務商，進行清空/tmp目錄，或者修改my.cnf中的tmpdir參數，指向具有足夠空間的目錄。",
        'HY000:1045'    => "數據庫配置參數不對，請仔細檢查覈對。",
        'HY000:1049'    => "數據庫不存在，請仔細檢查覈對。",
        'HY000:2002'    => "你的主機不支援 localhost 連線數據，導致報錯\n請點選：<a href='http://www.eyoucms.com/wenda/5711.html' target='_blank'>檢視教程</a>",
        'HY000:2013'    => "可能MySQL伺服器不支援127.0.0.1連線\n請點選：<a href='http://www.eyoucms.com/wenda/5950.html' target='_blank'>檢視教程</a>",
        'HY000:1290'    => "請重啟MySql數據庫，或者聯繫空間服務商處理。",
    ),
);
